#include<iostream>
#include<cmath>
using namespace std;

/*Налага се да се боядиса правоъгълна стена с дължина l и височина h- метра.
Известно е, че с една кутия боя може да се боядиса m кв.м. площ от стената.*/

/*Вход: стойности за l,h,m.
Изход: колко кутии са нужни за боядисване на стената.*/

int main() {
	double l, h, m, S, q;
	system("chcp 1251");
	cout << "Въведете дължината на стената: "; cin >> l;
	cout << "Въведете височината на стената: "; cin >> h;
	cout << "Въведете разходна норма за  кутия боя(кв.м.): "; cin >> m;
	S = l * h;
	q = ceil(S / m);
	cout << "Нужни кутии с боя: " << q << " броя \n";
	system("pause");
	return 0;
}